<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 9 changes.</summary>

```diff
# module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm has changed
! terraform_data.tailscale_node_deletion_hook[0] will be updated in-place
! module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm must be replaced
! module.proxmox_images.proxmox_virtual_environment_download_file.images["coreos_img"] must be replaced
! module.proxmox_images.proxmox_virtual_environment_download_file.images["debian_bookworm"] must be replaced
! module.proxmox_images.proxmox_virtual_environment_download_file.images["debian_trixie"] must be replaced
! module.proxmox_images.proxmox_virtual_environment_download_file.images["ubuntu_jammy"] must be replaced
! module.proxmox_images.proxmox_virtual_environment_download_file.images["ubuntu_noble_cloud_image"] must be replaced
! module.ubuntu_dev_vm.proxmox_virtual_environment_file.cloud_config must be replaced
+ module.ubuntu_dev_vm.proxmox_virtual_environment_vm.ubuntu_dev_vm will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 8 to add, 1 to change, 7 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-03T02:10:13Z [(view log)](https://github.com/perchnet/p/actions/runs/16700055275/job/47269630201#step:11:1).
</summary>

```hcl

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm has changed
  ~ resource "proxmox_virtual_environment_vm" "coreos_vm" {
        id                      = "131"
      ~ ipv4_addresses          = [
            # (2 unchanged elements hidden)
            [],
          + [
              + "172.17.0.1",
            ],
        ]
      ~ ipv6_addresses          = [
            [
                "::1",
            ],
          - [
              - "2600:4808:6170:3a00:3801:6ff7:86c9:abc4",
              - "fe80::9f5a:7730:7415:de5a",
            ],
          - [
              - "fe80::d80b:1cdd:1c17:c79b",
            ],
          + [
              + "2600:4808:6170:3a00::25eb",
              + "2600:4808:6170:3a00:3801:6ff7:86c9:abc4",
              + "fe80::9f5a:7730:7415:de5a",
            ],
          + [
              + "fe80::642c:650b:165a:8dd8",
            ],
          + [],
        ]
      ~ mac_addresses           = [
            # (2 unchanged elements hidden)
            "00:00:00:00:00:00",
          + "42:C7:44:3E:98:61",
        ]
        name                    = "tf-coreos-periphery-E1o"
      ~ network_interface_names = [
            # (2 unchanged elements hidden)
            "tailscale0",
          + "docker0",
        ]
        tags                    = [
            "terraform",
        ]
        # (26 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # terraform_data.tailscale_node_deletion_hook[0] will be updated in-place
  ~ resource "terraform_data" "tailscale_node_deletion_hook" {
        id               = "aa300efb-c501-faee-8c42-30d09544594b"
      ~ input            = (sensitive value)
      ~ output           = [
          - "nhx2BCDuzD11CNTRL",
          - "tskey-api-kPuvyHR7K221CNTRL-dKNhMSBTt18uBuG2Z9Vmv7DDVNvdf2458",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm must be replaced
-/+ resource "proxmox_virtual_environment_vm" "coreos_vm" {
      ~ id                      = "131" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "192.168.1.23",
            ],
          - [],
          - [
              - "172.17.0.1",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "2600:4808:6170:3a00::25eb",
              - "2600:4808:6170:3a00:3801:6ff7:86c9:abc4",
              - "fe80::9f5a:7730:7415:de5a",
            ],
          - [
              - "fe80::642c:650b:165a:8dd8",
            ],
          - [],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "BC:24:11:CD:36:2E",
          - "00:00:00:00:00:00",
          - "42:C7:44:3E:98:61",
        ] -> (known after apply)
        name                    = "tf-coreos-periphery-E1o"
      ~ network_interface_names = [
          - "lo",
          - "ens18",
          - "tailscale0",
          - "docker0",
        ] -> (known after apply)
        tags                    = [
            "terraform",
        ]
      ~ vm_id                   = 131 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ disk {
          ~ file_format       = "raw" -> (known after apply)
          ~ file_id           = "zssd-files:iso/fedora-coreos-42_TFimg-0994.20250721.2.0-proxmoxve.x86_64.qcow2.xz.img" -> (known after apply) # forces replacement
          ~ path_in_datastore = "vm-131-disk-0" -> (known after apply)
            # (12 unchanged attributes hidden)
        }

      ~ initialization {
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:CD:36:2E" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.proxmox_images.proxmox_virtual_environment_download_file.images["coreos_img"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "images" {
      ~ file_name               = "fedora-coreos-42_TFimg-0994.20250721.2.0-proxmoxve.x86_64.qcow2.xz.img" -> "TFimg_fedora-coreos-42-0994.20250721.2.0-proxmoxve.x86_64.qcow2.xz.img" # forces replacement
      ~ id                      = "zssd-files:iso/fedora-coreos-42_TFimg-0994.20250721.2.0-proxmoxve.x86_64.qcow2.xz.img" -> (known after apply)
      ~ size                    = 1986920448 -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.proxmox_images.proxmox_virtual_environment_download_file.images["debian_bookworm"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "images" {
      ~ file_name           = "debian-12-nocloud-amd64_TFimg-2fbe.qcow2.img" -> "TFimg_debian-12-nocloud-amd64-2fbe.qcow2.img" # forces replacement
      ~ id                  = "zssd-files:iso/debian-12-nocloud-amd64_TFimg-2fbe.qcow2.img" -> (known after apply)
      ~ size                = 419627008 -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.proxmox_images.proxmox_virtual_environment_download_file.images["debian_trixie"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "images" {
      ~ file_name           = "debian-13-genericcloud-amd64_TFimg-a110.qcow2.img" -> "TFimg_debian-13-genericcloud-amd64-a110.qcow2.img" # forces replacement
      ~ id                  = "zssd-files:iso/debian-13-genericcloud-amd64_TFimg-a110.qcow2.img" -> (known after apply)
      ~ size                = 434110464 -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.proxmox_images.proxmox_virtual_environment_download_file.images["ubuntu_jammy"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "images" {
      ~ file_name           = "ubuntu-22_TFimg-d4a5.04-server-cloudimg-amd64.img" -> "TFimg_ubuntu-22-d4a5.04-server-cloudimg-amd64.qcow.iso" # forces replacement
      ~ id                  = "zssd-files:iso/ubuntu-22_TFimg-d4a5.04-server-cloudimg-amd64.img" -> (known after apply)
      ~ size                = 678153216 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.proxmox_images.proxmox_virtual_environment_download_file.images["ubuntu_noble_cloud_image"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "images" {
      ~ file_name           = "ubuntu-24_TFimg-9a7f.04-cloudimg-amd64.qcow.iso" -> "TFimg_ubuntu-24-9a7f.04-cloudimg-amd64.qcow.iso" # forces replacement
      ~ id                  = "zssd-files:iso/ubuntu-24_TFimg-9a7f.04-cloudimg-amd64.qcow.iso" -> (known after apply)
      ~ size                = 613725184 -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.ubuntu_dev_vm.proxmox_virtual_environment_file.cloud_config must be replaced
-/+ resource "proxmox_virtual_environment_file" "cloud_config" {
      + file_modification_date = (known after apply)
      ~ file_name              = "example.cloud-config.yaml" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "snippets:snippets/example.cloud-config.yaml" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = (sensitive value) # forces replacement
            # (2 unchanged attributes hidden)
        }
    }

  # module.ubuntu_dev_vm.proxmox_virtual_environment_vm.ubuntu_dev_vm will be created
  + resource "proxmox_virtual_environment_vm" "ubuntu_dev_vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "ubuntu-dev"
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = true
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "ubuntu",
          + "tailscale",
          + "docker",
          + "dev",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = (known after apply)

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + cores      = 3
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "host"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "zssd"
          + discard           = "ignore"
          + file_format       = "raw"
          + import_from       = (known after apply)
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 8
          + ssd               = false
        }

      + initialization {
          + datastore_id         = "zssd-files"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }

          + user_account {
              + keys     = [
                  + "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEyhYKsPcfOeY139vtFE5E5KTsdtAboxZD8jRvy2VpBA",
                ]
              + password = (sensitive value)
              + username = "ubuntu"
            }
        }

      + memory {
          + dedicated      = 4096
          + floating       = 4096
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + serial_device {
          + device = "socket"
        }

      + tpm_state {
          + datastore_id = "zssd"
          + version      = "v2.0"
        }

      + vga (known after apply)

      + virtiofs {
          + cache        = "always"
          + direct_io    = true
          + expose_acl   = false
          + expose_xattr = false
          + mapping      = "rust-root"
        }
    }

Plan: 8 to add, 1 to change, 7 to destroy.

Changes to Outputs:
  ~ images            = {
      ~ coreos_img               = {
          ~ file_name               = "fedora-coreos-42_TFimg-0994.20250721.2.0-proxmoxve.x86_64.qcow2.xz.img" -> "TFimg_fedora-coreos-42-0994.20250721.2.0-proxmoxve.x86_64.qcow2.xz.img"
          ~ id                      = "zssd-files:iso/fedora-coreos-42_TFimg-0994.20250721.2.0-proxmoxve.x86_64.qcow2.xz.img" -> (known after apply)
          ~ size                    = 1986920448 -> (known after apply)
            # (11 unchanged attributes hidden)
        }
      ~ debian_bookworm          = {
          ~ file_name               = "debian-12-nocloud-amd64_TFimg-2fbe.qcow2.img" -> "TFimg_debian-12-nocloud-amd64-2fbe.qcow2.img"
          ~ id                      = "zssd-files:iso/debian-12-nocloud-amd64_TFimg-2fbe.qcow2.img" -> (known after apply)
          ~ size                    = 419627008 -> (known after apply)
            # (11 unchanged attributes hidden)
        }
      ~ debian_trixie            = {
          ~ file_name               = "debian-13-genericcloud-amd64_TFimg-a110.qcow2.img" -> "TFimg_debian-13-genericcloud-amd64-a110.qcow2.img"
          ~ id                      = "zssd-files:iso/debian-13-genericcloud-amd64_TFimg-a110.qcow2.img" -> (known after apply)
          ~ size                    = 434110464 -> (known after apply)
            # (11 unchanged attributes hidden)
        }
      ~ ubuntu_jammy             = {
          ~ file_name               = "ubuntu-22_TFimg-d4a5.04-server-cloudimg-amd64.img" -> "TFimg_ubuntu-22-d4a5.04-server-cloudimg-amd64.qcow.iso"
          ~ id                      = "zssd-files:iso/ubuntu-22_TFimg-d4a5.04-server-cloudimg-amd64.img" -> (known after apply)
          ~ size                    = 678153216 -> (known after apply)
            # (11 unchanged attributes hidden)
        }
      ~ ubuntu_noble_cloud_image = {
          ~ file_name               = "ubuntu-24_TFimg-9a7f.04-cloudimg-amd64.qcow.iso" -> "TFimg_ubuntu-24-9a7f.04-cloudimg-amd64.qcow.iso"
          ~ id                      = "zssd-files:iso/ubuntu-24_TFimg-9a7f.04-cloudimg-amd64.qcow.iso" -> (known after apply)
          ~ size                    = 613725184 -> (known after apply)
            # (11 unchanged attributes hidden)
        }
    }
```
</details>
<!-- placeholder-5 -->
<!-- terraform-39-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->